{
    "name": "Michael",
    "title": "Ueichiryu Karate Do",
    "author": "George E. Mattson",
    "kata": {
        "name": "Konchin",
        "steps": [
            "Hands in a 'ready' position, body focused",
            "Step forward with your right foot as you drop your hands downward as shown. Perform four wrist blocks, first up , then down, then to the ouside and finally to the inside. Return hands to original position as you prepare for the next move.",
            "Step to the right side as shown on the foot diagram while blocking with your left arm. Kick with your left leg.",
            "Step off again to your right side as shown while blocking with your left arm. Kick with your left leg, returning kicking leg to rear position quickly after kick.",
            "Drop your right arm downward preparing to block while lowering your body slightly into a cat's stance posture. Raise your right leg slightly while performing a 'Wa-uke' leading with your right arm.",
            "Step forward slightly with your right foot, then take a large step with your left leg while beginning a left circle block.",
            "Complete your left circle block as you complete another large step into a 'leaning' stance position with your right leg. Lean slightly more into the stance while striking with your right elbow strike. Then perform a full circle block over your right knee with your right arm as you would should you wish to grab a front kick. Upon completion of this block, push away strongly upward while maintaining a bent arm posture.",
            "Bring your left leg in towards your right leg while pivoting your left. While pivoting, block downward with your left arm and draw your right arm towards your body as though you were grabbing a kick. Your left leg raises slightly, then drops to a cat's stance.",
            "Pivot again to your left into a full Sanchin posture. Perform three wrist blocks, then",
            "Pivot 45 degrees to your left while drawing your clenched fist in towards your body as shown. Perform an upward double block, focusing the outside of your arms stringly as you strike.",
            "Step into a horse stance with your right leg while drawing your arms back as shown. Push strongly inward in a circular pattern with both arms as shown. Then block downward with your right arm, being careful not raise your arm too high in preparation for the block. Perform a full circle block over your right knee, leading with your 'one knuckle' fist as though you were trying to encircle a pressing kick. Strongly push upwards with your arms, carefully avoiding straightening out your arms.",
            "Pivot 90 degrees to your left as you bring your arms to a Sanchin position, hands clenched using a 'one knuckle' fist position.",
            "Slide forward, keeping your left foot forward, while drawing your right fist back to a 'ready-thrust' position. Strike out strongly with your fist, being careful not to turn your fist over until the last split second, then strongly twisting your fist to a palm down position.",
            "Slide forward again with your left leg leading while withdrawing your right arm back. Strike out again with your right fist.",
            "For the third time, slide forward and perform a right knuckle strike.",
            "Step forward with your right leg into a horse stance while performing a full circle block over your right knee. Push upwards and outwards strongly as shown.",
            "Move your left leg inward and to the rear as you turn 180 degrees preparing to block with your left arm.",
            "Step into a horse stancewith your right leg as you complete your left arm block. Draw your right arm back to a ready-strike position. Hit your left hand strongly with your right elbow strike. Then drop your left palm outward while striking with your right backfist. Draw your right fist back, then strike out with a one-knuckle punch.",
            "Draw your right leg back as you pivot to your left, drawing both arms into a Sanchin position, legs into a left Sanchin stance.",
            "Perform a right Sanchin arm movement. Then perform a double 'Uechi' block as shown.",
            "Slide forward with your left leg while blocking with your left arm. Strike out with your 'one-knuckle' strike.",
            "Take a sliding step back to position #20 while placing your right fist on top of your left fist as shown.",
            "Place your left leg back to a 'neutural' stance"
        ]
    }
}
